Repository: aseelnrajab/split_youtube_app
Catalog: lib/l10n/app_*.arb
Languages: ar

# appTitle
source: YouTube + Live Camera
ar: يوتيوب + كاميرا مباشرة

source: Enable Camera
ar: تشغيل الكاميرا

source: Hide Camera
ar: إخفاء الكاميرا

source: Show Camera
ar: إظهار الكاميرا

# noCameraDetected
source: No available camera detected
ar: لم يتم العثور على كاميرا متاحة

source: Camera permission denied
ar: تم رفض إذن الكاميرا

source: Camera Permission Needed
ar: يتطلب إذن الكاميرا

# cameraPermissionDescription
source: Camera access has been permanently denied. Please enable it manually in Settings → Privacy → Camera.
ar: تم رفض الوصول إلى الكاميرا بشكل دائم. يرجى تفعيله يدويًا من الإعدادات → الخصوصية → الكاميرا.

source: Cancel
ar: إلغاء

source: Open Settings
ar: فتح الإعدادات

# cameraInitError
source: Camera initialization error:
ar: حدث خطأ أثناء تشغيل الكاميرا:

# noSecondaryCamera
source: No secondary camera found
ar: لم يتم العثور على كاميرا ثانية

# switchCam
source: Swap Camera
ar: تبديل الكاميرا
